package jp.gr.java_conf.hamakazeTorobe;

/**
 * Created by Tomoki on 2016/01/24.
 */
public class EquipList {
    //JSONとかにしたい
    Object[] equipCategory = {
            "装備の種類",
            "主砲", //1
            "主砲(対空砲)", //2
            "副砲", //3
            "魚雷", //4
            "艦載機", //5
            "電探", //6
            "機関", //7
            "砲弾", //8
            "ソナー", //9
            "爆雷", //10
            "対空機銃", //11
            "その他", //12
    };

    Object[] syuhou = {
            "装備名を選択",
            //主砲
            //小口径
            "12cm単装砲",
            "12.7cm連装砲",
            //"10cm連装高角砲",
            "12.7cm連装砲B型改二",
            //中口径
            "14cm単装砲",
            "15.5cm三連装砲(主砲)",
            "20.3cm連装砲",
            "20.3cm(3号)連装砲",
            "15.2cm連装砲",
            //大口径
            "35.6cm連装砲",
            "41cm連装砲",
            "46cm三連装砲",
    };

    Object[] taikuu = {
            "装備名を選択",
            //主砲（対空砲）
            "10cm連装高角砲",
            "12.7cm単装高角砲",
            "12.7cm連装高角砲",//?
            "8cm高角砲",//?
            "10cm連装高角砲(砲架)",//?
    };
    Object[] hukuhou = {
            "装備名を選択",
            //副砲
            "12.7cm連装高角砲",//?
            "15.2cm単装砲",
            "15.5cm三連装砲(副砲)",
            "8cm高角砲",//?
            "10cm連装高角砲(砲架)",//?
    };
    Object[] gyorai = {
            "装備名を選択",
            //魚雷
            "61cm三連装魚雷",
            "61cm四連装魚雷",
            "61㎝四連装(酸素)魚雷",
            "61㎝五連装(酸素)魚雷",
            "53㎝艦首(酸素)魚雷",

            //特殊潜航艇
            "甲標的 甲",
    };
    Object[] kansaiki = {
            "装備名を選択",
            //艦載機
            //艦上戦闘機
            "九六式艦戦",
            "零式艦戦21型",
            "零式艦戦52型",
            "烈風",
            "紫電改二",
            "震電改",
            //"烈風改",

            //艦上攻撃機
            "九七式艦攻",
            "天山",
            "流星",
            "流星改",

            //艦上爆撃機
            "九九式艦爆",
            "彗星",
            "彗星一二型甲",
            "零式艦戦62型(爆戦)",
            "Ju87C改",

            //艦上偵察機
            "彩雲",
            "二式艦上偵察機",

            //水上機
            "零式水上偵察機",
            "瑞雲",
            "零式水上観測機",
            "試製晴嵐",

            //上陸用舟艇
            "大発動艇",
    };
    Object[] dentan = {
            "装備名を選択",
            //電探

            //小型電探
            "13号対空電探",
            "22号対水上電探",
            "33号対水上電探",

            //大型電探
            "21号対空電探",
            "32号対水上電探",
            "14号対空電探",
    };
    Object[] kikan = {
            "装備名を選択",
            //機関
            "改良型艦本式タービン",
            "強化型艦本式缶",
    };
    Object[] houdan = {
            "装備名を選択",
            //砲弾
            "三式弾",
            "九一式徹甲弾",
    };
    Object[] sonar = {
            "装備名を選択",
            //ソナー
            "九三式水中聴音機",
            "三式水中探信儀",
    };
    Object[] bakurai = {
            "装備名を選択",
            //ソナー
            "九四式爆雷投射機",
            "三式爆雷投射機",
    };
    Object[] kijuu = {
            "装備名を選択",
            //対空機銃
            "7.7mm機銃",
            "12.7mm単装機銃",
            "25mm連装機銃",
            "25mm三連装機銃",
            "25mm単装機銃",
            "12cm30連装噴進砲",
    };
    Object[] etc = {
            "装備名を選択",
            //その他
            "応急修理要員",
            "応急修理女神",
    };


}